cases/reconstruction/lent-reconstruct-hex/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)

    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)

);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (32 32 32) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch walls 
    (
        // Bottom
        (3 2 1 0)
        // Top
        (4 5 6 7)
        // Front 
        (0 4 7 3)
        // Back
        (1 2 6 5)
        // Left 
        (2 3 7 6)
        // Right
        (0 1 5 4)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
